# IsRebarFreeForm Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..IsRebarFreeForm Method
Rebar Class See Also
---
Returns true if the rebar is free form and false if shape driven.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsRebarFreeForm()
```

Visual Basic
---
```text
Public Function IsRebarFreeForm As Boolean
```

Visual C++
---
```text
public:
bool IsRebarFreeForm()
```

# ### Return Value
Returns true if the rebar is free form and false if shape driven.
# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace